#!/usr/bin/env python
# coding: utf-8

చెల్లు = 5
సందర్భం = True
if సందర్భం:
    print("చెల్లు:", చెల్లు)
    print("సందర్భం:", సందర్భం)
else:
    print("అబద్ధం: తప్పు")


సంఖ్యలు = [1, 2, 3, 4, 5]
మొత్తం = 0
for సంఖ్య in సంఖ్యలు:
    మొత్తం += సంఖ్య

print("సంఖ్యల మొత్తం:", మొత్తం)


కౌంట్ = 10
for సంఖ్య in range(కౌంట్):
    print(కౌంట్)
    కౌంట్ += 1


class నావర్గము:
    సందేశం = "ఇది ఒక వర్గం"

    def print_సందేశం(సందేశం):
        print(సందేశం)


పథం = "/వర్గం/ఉదాహరణ/పథం/ఫైల్.టెక్స్ట్"
try:
    with open(పథం) as ఫైల్:
        pass
except:
    print("ఫైల్ కనుగొనబడలేదు")
