#!/usr/bin/env python
# coding: utf-8

చెల్లు = 5
సందర్భం = నిజం
ఐతే సందర్భం:
    ముద్రించు("చెల్లు:", చెల్లు)
    ముద్రించు("సందర్భం:", సందర్భం)
లేదా:
    ముద్రించు("అబద్ధం: తప్పు")


సంఖ్యలు = [1, 2, 3, 4, 5]
మొత్తం = 0
ప్రతి సంఖ్య లో సంఖ్యలు:
    మొత్తం += సంఖ్య

ముద్రించు("సంఖ్యల మొత్తం:", మొత్తం)


కౌంట్ = 10
ప్రతి సంఖ్య లో శ్రేణి(కౌంట్):
    ముద్రించు(కౌంట్)
    కౌంట్ += 1


వర్గం నావర్గము:
    సందేశం = "ఇది ఒక వర్గం"
    నిర్వచనం ముద్రించు_సందేశం(సందేశం):
        ముద్రించు(సందేశం)


పథం = "/వర్గం/ఉదాహరణ/పథం/ఫైల్.టెక్స్ట్"
ప్రయత్నించు:
    తో open(పథం) లా ఫైల్:
        కానివ్వు
తప్ప:
    ముద్రించు("ఫైల్ కనుగొనబడలేదు")
