#!/usr/bin/env python
# coding: utf-8

संवेदनशीलता = 5
शर्त = सच
अगर शर्त:
    मुद्र("संवेदनशीलता:", संवेदनशीलता)
    मुद्र("शर्त:", शर्त)
अन्यथा:
    मुद्र("असत्य: सही")

संख्याएँ = [1, 2, 3, 4, 5]
कुल = 0
के_लिए ऐ में संख्याएँ:
    कुल += ऐ
    मुद्र("संख्याओं का योग:", कुल)

गणना = 10
के_लिए ऐ में श्रेणी(गणना):
    मुद्र(ऐ)
    गणना += 1


वर्ग मेरी_कक्षा:
    संदेश = "यह एक कक्षा है"

    निर्धारित मुद्र_संदेश(self):
        मुद्र(self.संदेश)


पथ = "/कक्षा/उदाहरण/पथ/फ़ाइल.टेक्स्ट"
प्रयास:
    साथ खोलें(पथ) जैसा फ़ाइल:
        चलो
अपवाद:
    मुद्र("फ़ाइल नहीं मिली")
